{
   "class_name":"Model",
   "keras_version":"2.1.2",
   "config":{
      "layers":[
         {
            "class_name":"InputLayer",
            "config":{
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  1,
                  12,
                  32,
                  32
               ],
               "name":"input_1",
               "sparse":false
            },
            "inbound_nodes":[

            ],
            "name":"input_1"
         },
         {
            "class_name":"InputLayer",
            "config":{
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  1,
                  12,
                  32,
                  32
               ],
               "name":"input_2",
               "sparse":false
            },
            "inbound_nodes":[

            ],
            "name":"input_2"
         },
         {
            "class_name":"InputLayer",
            "config":{
               "dtype":"float32",
               "batch_input_shape":[
                  null,
                  1,
                  12,
                  32,
                  32
               ],
               "name":"input_3",
               "sparse":false
            },
            "inbound_nodes":[

            ],
            "name":"input_3"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_1",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "input_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_1"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_10",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "input_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_10"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_19",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "input_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_19"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_1",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_1"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_10",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_10",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_10"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_19",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_19",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_19"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_1"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_1"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_11"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_10",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_11"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_21"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_19",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_21"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_2",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_2"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_11",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_11",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_11"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_20",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":4,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_21",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_20"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_2",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_2"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_11",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_11",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_11"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_20",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_20",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_20"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_2"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_2"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_12"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_11",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_12"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_22"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_20",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_22"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_3",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_2",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_3"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_12",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_12",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_12"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_21",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_22",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_21"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_3",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_3"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_12",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_12",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_12"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_21",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_21",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_21"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_3"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_3"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_13"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_12",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_13"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_23"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_21",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_23"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_4",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_3",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_4"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_13",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_13",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_13"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_22",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":8,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  3,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_23",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_22"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_4",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_4",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_4"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_13",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_13",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_13"
         },
         {
            "class_name":"BatchNormalization",
            "config":{
               "beta_constraint":null,
               "gamma_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "moving_mean_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "name":"batch_normalization_22",
               "epsilon":0.001,
               "trainable":true,
               "moving_variance_initializer":{
                  "class_name":"Ones",
                  "config":{

                  }
               },
               "beta_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "scale":true,
               "axis":1,
               "gamma_constraint":null,
               "gamma_regularizer":null,
               "beta_regularizer":null,
               "momentum":0.99,
               "center":true
            },
            "inbound_nodes":[
               [
                  [
                     "conv3d_22",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"batch_normalization_22"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_4"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_4",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_4"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_14"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_13",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_14"
         },
         {
            "class_name":"LeakyReLU",
            "config":{
               "alpha":0.30000001192092896,
               "trainable":true,
               "name":"leaky_re_lu_24"
            },
            "inbound_nodes":[
               [
                  [
                     "batch_normalization_22",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"leaky_re_lu_24"
         },
         {
            "class_name":"MaxPooling3D",
            "config":{
               "name":"max_pooling3d_1",
               "trainable":true,
               "data_format":"channels_first",
               "pool_size":[
                  1,
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  1,
                  2,
                  2
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_4",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"max_pooling3d_1"
         },
         {
            "class_name":"MaxPooling3D",
            "config":{
               "name":"max_pooling3d_2",
               "trainable":true,
               "data_format":"channels_first",
               "pool_size":[
                  1,
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  1,
                  2,
                  2
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_14",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"max_pooling3d_2"
         },
         {
            "class_name":"MaxPooling3D",
            "config":{
               "name":"max_pooling3d_3",
               "trainable":true,
               "data_format":"channels_first",
               "pool_size":[
                  1,
                  2,
                  2
               ],
               "padding":"valid",
               "strides":[
                  1,
                  2,
                  2
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "leaky_re_lu_24",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"max_pooling3d_3"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
                     "mode":"fan_in"
                  }
               },
               "name":"conv3d_5",
               "bias_regularizer":null,
               "bias_constraint":null,
               "activation":"linear",
               "trainable":true,
               "data_format":"channels_first",
               "padding":"valid",
               "strides":[
                  1,
                  1,
                  1
               ],
               "dilation_rate":[
                  1,
                  1,
                  1
               ],
               "kernel_regularizer":{
                  "class_name":"L1L2",
                  "config":{
                     "l2":0.004999999888241291,
                     "l1":0.0
                  }
               },
               "filters":16,
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "use_bias":true,
               "activity_regularizer":null,
               "kernel_size":[
                  1,
                  3,
                  3
               ]
            },
            "inbound_nodes":[
               [
                  [
                     "max_pooling3d_1",
                     0,
                     0,
                     {

                     }
                  ]
               ]
            ],
            "name":"conv3d_5"
         },
         {
            "class_name":"Conv3D",
            "config":{
               "kernel_constraint":null,
               "kernel_initializer":{
                  "class_name":"VarianceScaling",
                  "config":{
                     "distribution":"normal",
                     "scale":2.0,
                     "seed":null,
